Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: First, here is an example that closes another script:
pt_br: Primeiro, eis um exemplo que fecha outro script:

source: Floating-point numbers can also be formatted by using the Round function.
pt_br: Números de ponto flutuante também podem ser formatados usando-se a função Round.

source: Floating-point numbers generally support 15 digits of precision.
pt_br: Números de ponto flutuante geralmente suportam 15 dígitos de precisão.

source: For Call, .Name and [Parameter] can be used interchangeably, and must always be followed by (Parameters):
pt_br: Para Call, .Name e [Parâmetro] podem ser usados indistintamente, e devem sempre ser seguidos de (Parâmetros):

source: For Get and Set, .Name and [Parameters] can be used interchangeably, or in combination:
pt_br: Para Get e Set, .Name e [Parâmetros] podem ser usados indistintamente, ou em conjunto:

source: For AutoHotkey versions older than 1.1.08.00, use uninst.exe /S.
pt_br: Para versos do AutoHotkey anteriores à 1.1.08.00, use uninst.exe /S.

source: For Example:
pt_br: Por exemplo:

source: For SendEvent, SendInput and ControlSend, this improves reliability because the characters are much less dependent on correct modifier state.
pt_br: Para SendEvent, SendInput e ControlSend, isso melhora a confiabilidade porque os caracteres são muito menos dependentes da precisão do estado da tecla modificadora - se pressionada ou solta.

source: For a list of all built-in commands, function and variables, see section 5.
pt_br: Para uma lista de comandos, funções e variáveis nativos, veja a seção 5.

source: For a more detailed explanation of how strings work, see String Encoding.
pt_br: Para uma explicação mais detalhada de como strings funcionam, veja Codificação de Strings.

source: For a variable x := 42, we can also say that the variable x has the number 42 as its value, or that the value of x is 42.
pt_br: Para uma variável x := 42, nós também podemos dizer que a variável x tem o número 42 como seu valor, ou que o valor de x é 42.

source: For a video instruction, watch Install and Hello World on YouTube.
pt_br: Para instruções em vídeo, assista Instalar e Hello World no YouTube (em inglês).

source: For an integer ID, the resource name must be a hash sign (#) followed by a decimal number.
pt_br: Para o ID de um número inteiro, o nome do recurso deve ser uma cerquilha (#) seguida de um número decimal.

source: For command-line installations, specify /uiAccess or /uiAccess=1 to enable the option and /uiAccess=0 to disable it.
pt_br: Para instalações na linha de comando, especifique /uiAccess ou /uiAccess=1 para habilitar a opção e /uiAccess=0 para desabilitá-la.

source: For complex scripts, see Interactive Debugging.
pt_br: Para scripts complexos, vide Depuração Interativa.

source: For details about syntax - that is, how to write or recognise control flow statements in AutoHotkey - see Control Flow.
pt_br: Para detalhes sobre a sintaxe - isto é, como escrever ou reconhecer instruções de fluxo de controle no AutoHotkey - veja Fluxo de Controle.

source: For details about the range and accuracy of numeric values, see Pure Numbers.
pt_br: Para detalhes sobre o intervalo e a precisão de valores numéricos, veja Números Puros.

source: For details, see Legacy Syntax and Strings (in expressions).
pt_br: Para detalhes, veja Sintaxe Legada e Strings (em expressões).

source: For details, see auto-execute section.
pt_br: Para detalhes, vide seção de autoexecução.

source: For details, see Object Protocol.
pt_br: Para detalhes, vide Protocolo dos Objetos.

source: For details, see the FAQ.
pt_br: Para detalhes, veja o FAQ.

source: For details, see the remarks below.
pt_br: Para detalhes, veja as observações abaixo.

source: For example, 'A' always has the character code 65.
pt_br: Por exemplo, “A” sempre terá o código de caractere 65.

source: For example, 2joy1 is the second joystick's first button.
pt_br: Por exemplo, 2joy1 é o primeiro botão do segundo joystick.

source: For example, Clipboard retrieves the current contents of the clipboard as text, and A_TimeSinceThisHotkey calculates the number of milliseconds that have elapsed since the hotkey was pressed.
pt_br: Por exemplo, Clipboard obtém o valor do conteúdo atual da área de transferência como texto, e A_TimeSinceThisHotkey calcula o número de milissegundos que se passaram desde que a hotkey foi pressionada.

source: For example, StrLen() returns the number of characters in a string.
pt_br: Por exemplo, StrLen() retorna o número de caracteres em uma string.

source: For example, WinMove moves a window, so its parameters tell it which window to move and where to move it to.
pt_br: Por exemplo, WinMove move uma janela, então seus parâmetros irão dizer qual janela mover e para onde movê-la.

source: For example, #Space is Win+Space and ^!Tab is Ctrl+Alt+Tab.
pt_br: Por exemplo, #Space e Win+Space e ^!Tab é Ctrl+Alt+Tab.

source: For example, 42 and 42.0 are usually interchangeable, but not always.
pt_br: Por exemplo, 42 e 42.0 são geralmente equivalentes, mas nem sempre.

source: For example, ComObjActive("Word.Application") will fail because Word is not marked for UI Access.
pt_br: Por exemplo, ComObjActive("Word.Application") vai falhar porque o Microsoft Word não está marcado para acesso com IU.

source: For example, ^space::Send {Ctrl up} automatically pushes Ctrl back down if the user is still physically holding Ctrl, whereas ^space::Send {Blind}{Ctrl up} allows Ctrl to be logically up even though it is physically down.
pt_br: Por exemplo, ^space::Send {Ctrl up} automaticamente pressiona Ctrl de novo se o usuário ainda estiver fisicamente segurando Ctrl, ao passo que ^space::Send {Blind}{Ctrl up} permite que Ctrl esteja logicamente solta apesar de estar fisicamente pressionada.

source: For example, myObject.@home() is not valid, but myObject["@home"]() is acceptable.
pt_br: Por exemplo, meuObjeto.@home() não é válido, mas meuObjeto["@home"]() é aceitável.

source: For example, x := x + 1 will not work if x has never been assigned a value, since the empty string is considered to be non-numeric.
pt_br: Por exemplo, x := x + 1 não irá funcionar se à variável x nunca tiver sido atribuído um valor antes, já que a string vazia é considerada não numérica.

source: For example, CurrentDate is the same as currentdate.
pt_br: Por exemplo, CurrentDate é o mesmo que currentdate.

source: For example, Send, +abC would send the text "AbC", and Send, !+a would press Alt+Shift+A.
pt_br: Por exemplo, Send, +abC envia o texto “AbC”, e Send, !+a pressiona Alt+Shift+A.

source: For example, Send, This is text!a would send the keys "This is text" and then press Alt+A.
pt_br: Por exemplo, Send, Isto é texto!a enviaria as letras (teclas) “Isto é texto” e depois pressionaria Alt+A.

source: For example, Send, ^!a would press Ctrl+Alt+A, and Send, ^{Home} would send Ctrl+Home.
pt_br: Por exemplo, Send, ^!a faz pressionar Ctrl+Alt+A, enquanto Send, ^{Home} faz pressionar Ctrl+Home.

source: For example, {Tab} is Tab and {!} is a literal exclamation mark.
pt_br: Por exemplo, {Tab é Tab e {!} é um ponto de exclamação literal.

source: For example, SendRaw ``100`% sends the string `100%.
pt_br: Por exemplo, SendRaw ``100% envia a string `100%.

source: For example, !A presses Alt+Shift+A and !a presses Alt+A.
pt_br: Por exemplo, !A pressiona Alt+Shift+A e !a pressiona Alt+A.

source: For example, 0x001 is valid, but 000x1 is not.
pt_br: Por exemplo, 0x001 é válido, mas 000x1 não é.

source: For example, {Raw}.
pt_br: Por exemplo, {Raw}.

source: For example, vk1Bsc001:: raises an error in v1.1.27+, but sc001 was ignored (had no effect) in previous versions.
pt_br: Por exemplo, vk1Bsc001:: gera um erro nas versões 1.1.27 e posteriores, mas sc001 foi ignorada (não tinha efeito) nas versões anteriores.

source: For example, a WebBrowserTitle variable could be used to make your code easier to update when and if you were to change your preferred web browser, or if the title or window class changes due to a software update.
pt_br: Por exemplo, uma variável TituloDoNavegadorWeb pode ser usada para fazer seu código mais fácil de atualizar quando você resolver mudar seu browser preferido, ou se o título ou classe de janela muda devido a uma atualização de software.

source: For example, a BankAccount object might have properties such as the account number, current balance and the owner of the account, and methods to withdraw or deposit an amount.
pt_br: Por exemplo, um objeto ContaBancaria pode ter propriedades como o número da conta, o saldo atual e o titular da conta, e métodos para sacar ou depositar um valor.

source: For example, a hotkey could use a variable press_count to count the number of times it is pressed, and send a different key whenever press_count is a multiple of 3 (every third press).
pt_br: Por exemplo, uma hotkey pode usar uma variável contagem_pressionamentos para contar o número de vezes que ela foi pressionada, e enviar o pressionamento de uma tecla diferente toda vez que contagem_pressionamentos for um múltiplo de 3 (a cada três pressionamentos).

source: For example, an object could contain an array or sequence of items, or a set of related values, such as the X and Y coordinates of a position on the screen.
pt_br: Por exemplo, um objeto poderia conter um vetor ou sequência de itens, ou um conjunto de valores relacionados, como as coordenadas X e Y de uma posição na tela.

source: For example, both Send {Raw}{Tab} and SendRaw {Tab} send {Tab} instead of Tab.
pt_br: Por exemplo, tanto Send {Raw}{Tab} e SendRaw {Tab} enviam {Tab} em vez de Tab.

source: For example, consider this simple set of instructions:
pt_br: Considere, como exemplo, este pequeno conjunto de instruções:

source: For example, if you are running AutoHotkeyU32.exe, look for AutoHotkeyU32.ahk.
pt_br: Por exemplo, se você está rodando o executável AutoHotkeyU32.exe, procure por AutoHotkeyU32.ahk.

source: For example, if you configure a mystery key to send Ctrl+F1, you can then indirectly make that key as a hotkey by using ^F1:: in a script.
pt_br: Por exemplo, se você configurar a tecla misteriosa para enviar Ctrl+F1, você pode então criar indiretamente uma hotkey com aquela tecla usando ^F1:: em um script.

source: For example, if you configure the fourth button to send Ctrl+F1, you can then indirectly configure that button as a hotkey by using ^F1:: in a script.
pt_br: Por exemplo, se você configurar o quarto botão para enviar Ctrl+F1, você pode então indiretamente configurar aquele botão como uma hotkey usando ^F1:: em um script.

source: For example, one can pass the name of a key to GetKeyState() to determine whether that key is being held down.
pt_br: Por exemplo, alguém pode passar o nome de uma tecla para GetKeyState() para determinar se aquela tecla está sendo mantida pressionada.

source: For example, the Send command sends keystrokes, but may return before the keystrokes reach their destination and cause their intended effect.
pt_br: Por exemplo, o comando Send envia pressionamentos de teclas, mas podem retornar antes que as teclas pressionadas cheguem ao seu destino e gerem seu efeito pretendido.

source: For example, the body of an if statement is executed only if a specific condition is met.
pt_br: Por exemplo, o corpo de uma instrução com if é executado somente se uma condição específica é atingida.

source: For example, the expression (x <= y) is true when x has lesser or equal value to y.
pt_br: Por exemplo, a expressão (x <= y) é verdadeira quando x tem valor igual ou menor que y.

source: For example, the following hotkey does not use the keyboard hook, but as a side-effect it is triggered by pressing either Home or NumpadHome:
pt_br: Por exemplo, a hotkey a seguir não usa o gancho de teclado, mas como um efeito colateral ela é acionada ao se pressionar tanto Home quanto NumpadHome:

source: For example, the following installs silently and sets ANSI 32-bit as the default:
pt_br: POR EXEMPLO, o comando a seguir instala silenciosamente e define a versão ANSI 32 bits como a padrão.

source: For example, the hotkey +s::Send {Blind}abc would send ABC rather than abc because the user is holding down Shift.
pt_br: Por exemplo, a hotkey +s::Send {Blind}abc enviaria ABC em vez de abc porque o usuário está mantendo Shift pressionada.

source: For example, the name of a key to send or a program to run, the number of times a hotkey has been pressed, the title of a window to activate, or whatever else has some meaning within the program or script.
pt_br: Por exemplo, o nome de uma tecla a ser enviada ou um programa a executar, o número de vezes que uma hotkey foi pressionada, o título de uma janela a ser ativada, ou qualquer que seja a coisa que tenha algum significado dentro do programa ou script.

source: For example, the remapping a::b would produce:
pt_br: Por exemplo, o remapeamenteo a::b produziria:

source: For example, the syntax for ControlSend is:
pt_br: Por exemplo, a sintaxe para ControlSend é:

source: For example, the value "Abc" would be represented as follows:
pt_br: Por exemplo, o valor “Abc” seria representado assim:

source: For example:
pt_br: Por exemplo:

source: For floats, the number is not stored, since SetFormat affects the precision of the value, possibly even truncating all decimal places.
pt_br: Para pontos flutuantes, o número não é armazenado, já que o comando SetFormat afeta a precisão do valor, possivelmente truncando todas as casas decimais.

source: For further assistance, post on the forums.
pt_br: Para mais assistência, poste nos fóruns.

source: For further explanation of how percent signs are used, see Legacy Syntax and Dynamic Variables.
pt_br: Para explicações mais detalhadas de como usar os sinais de porcentagem, veja Sintaxe Legada e Variáveis Dinâmicas.

source: For instance, MyScript.exe automatically runs MyScript.ahk if a filename is not supplied, but is also capable of running other scripts.
pt_br: Por exemplo, MeuScript.exe automaticamente executa MeuScript.ahk se um nome de arquivo não for fornecido, mas também é capaz de rodar outros scripts.

source: For instance, giving a person a nickname doesn't cause a clone of that person to come into existence.
pt_br: Exemplificativamente, dar a uma pessoa um apelido não faz com que surja um clone daquela pessoa.

source: For instance, if you've got a new computer, it might have different drivers or other software installed.
pt_br: Por exemplo, se você adquiriu um novo computador, ele pode ter drivers diferentes ou outros programas instalados.

source: For instance, one can improve or modify one section of code without having to know the details of other sections, and without having to make corresponding changes to those sections.
pt_br: Por exemplo, alguém pode melhorar ou modificar uma seção de código sem precisar saber os detalhes de outra seção, e sem ter que realizar as modificações necessárias a tais seções.

source: For instance, we might say "myArray is an array", but what we really mean is that myArray is a variable containing a reference to an array.
pt_br: Exemplificativamente, nós poderíamos dizer “meuVetor é um vetor”, mas o que realmente queremos dizer é que meuVetor é uma variável contendo uma referência a um vetor.

source: For integers, the number is also stored, so this doesn't have adverse effects other than to performance.
pt_br: Para inteiros, o número também é armazenado, então isso não tem efeitos adversos para além da performance.

source: For more details about each mode, see SendInput and SendPlay below.
pt_br: Para mais detalhes de cada modo, veja SendInput e SendPlay abaixo.

source: For more details, see Enable interaction with administrative programs on the archive forum.
pt_br: Para mais detalhes, veja Habilitar interação com programas administrativos no fórum arquivado.

source: For more in-depth information and examples, check out the Run page.
pt_br: Para informações mais detalhadas e comandos similares, confira a página do comando Run.

source: For more in-depth information and similar commands, check out the #IfWinActive page.
pt_br: Para informações mais detalhadas e comandos similares, confira a página #IfWinActive.

source: For more information about the VKnn method, see Special Keys.
pt_br: Para mais informações sobre o método VKnn, vide Teclas Especiais.

source: For more information on what each one does, read this.
pt_br: Para mais informações sobre o que cada um faz, leia isto.

source: For more information, read about Continuation Sections.
pt_br: Para mais informações, leia sobre Continuações de Seção.

source: For more specific details about syntax, see Scripting Language.
pt_br: Para detalhes mais específicos sobre a sintaxe, veja Linguagem de Confecção de Scripts.

source: For optimal learning power, it is advised that you read the text and try the code.
pt_br: Para otimizar seu poder de aprendizado, recomenda-se que você leia o texto e teste o código.

source: For performance, AutoHotkey sometimes also stores the length, such as when a string is stored in a variable.
pt_br: Com vistas no desempenho, o AutoHotkey às vezes armazena o comprimento, como na ocasião em que uma string é armazenada numa variável.

source: For possible solutions, see further below.
pt_br: Para possíveis soluções, continue lendo.

source: For practical reasons, the length of a string and positions within a string are measured by counting these fixed-size units, even though they may not be complete Unicode characters.
pt_br: Por razões de praticidade, o comprimento de uma string e posições no interior de uma string são medidas contando-se essas unidades de tamanho fixo, mesmo que elas possam não ser caracteres Unicode completos.

source: For resources other than *#1, the resource specifier is included in the main window's title to support #SingleInstance and Reload.
pt_br: Para recursos além de *#1, o especificador do recurso é incluído no título da janela principal para suportar #SingleInstance e Reload.

source: For simple scripts, see Debugging a Script.
pt_br: Para scripts simples, veja Depurando um Script.

source: For this guide we will use the Installer since it is easiest to set up.
pt_br: Para este guia, vamos usar o instalador, já que é a forma mais fácil.

source: For this reason, the target object (which may be a variable or sub-expression) is specified to left of the method name instead of inside the parameter list.
pt_br: Por essa razão, o objeto alvo (que pode ser uma variável ou sub-expressão) é especificado à esquerda do nome do método em vez de dentro da lista de parâmetros.

source: Forward
pt_br: Avançar

source: Frequently Asked Questions (FAQ)
pt_br: Perguntas Frequentes (FAQ)

source: Frequently Asked Questions (FAQ) | AutoHotkey
pt_br: Perguntas Frequentes (FAQ) | AutoHotkey

source: Frequently asked questions
pt_br: Perguntas frequentes

source: Function Keys
pt_br: Teclas de Função

source: Function keys.
pt_br: Teclas de função.

source: Function(Parameter1, Parameter2, Parameter3)
pt_br: Funcao(Parametro1, Parametro2, Parametro3)

source: Functions
pt_br: Funções

source: Functions return a value, so the result of the function is often called a return value.
pt_br: Funções retornam um valor, então o resultado da função é frequentemente chamado de valor de retorno.

source: Functions and commands usually expect parameters to be written in a specific order, so the meaning of each parameter value depends on its position in the comma-delimited list of parameters.
pt_br: Funções e comandos normalmente aguardam que parâmetros sejam escritos em uma ordem específica, então o significado de cada parâmetro depende de sua posição na lista de parâmetros, que é separada por vírgulas.

source: Functions can go inside of functions:
pt_br: Funções podem ocorrer dentro de outras funções:

source: Functions have a few main differences:
pt_br: Funções têm algumas diferenças principais:

source: Functions may also do this, such as when there is more than one result.
pt_br: Funções também podem fazer isso, como quando há mais de um resultado.

source: Functions/Commands
pt_br: Funções/Comandos

source: Games
pt_br: Jogos

source: General Buttons
pt_br: Botões Gerais

source: General Keys
pt_br: Teclas Gerais

source: General Troubleshooting
pt_br: Resolução de Problemas em Geral

source: Generally one can simply think of it as "the value being assigned".
pt_br: Geralmente alguém pode simplesmente pensar nele como “o valor que está sendo atribuído”.

source: Generally, Set has the same meaning as an assignment, so it uses the same operator:
pt_br: Geralmente, Set tem o mesmo significado de uma atribuição de valor, então usa o mesmo operador:

source: Getting Started
pt_br: Primeiros passos

source: Getting started:
pt_br: Primeiros passos:

source: Getting user input
pt_br: Recebendo entrada do usuário

source: Give as much information as you can to educate us doorknobs at what you are trying to do.
pt_br: Forneça o máximo de informações que você puder de forma que você deixe claro para nós, plantas, o que você está tentando fazer.

source: Give the script a new name.
pt_br: Dê um nome novo ao script.

source: Go get some reward snacks then return to reading the rest of this tutorial.
pt_br: Agora vá buscar um lanchinho como recompensa e volte para ler o resto deste tutorial.

source: Go into your harddrive that contains AutoHotkey.
pt_br: Vá ao disco rígido ou partição que contém o AutoHotkey.

source: Go to the AutoHotkey Homepage:
pt_br: Vá ao site do AutoHotkey:

source: Go to your desktop.
pt_br: Vá para sua área de trabalho.

source: Gui, Add, Button,, Submit
pt_br: Gui, Add, Button,, Enviar

source: Gui, Add, Edit, vAssociatedVar
pt_br: Gui, Add, Edit, vVariavelAssociada

source: Gui, Add, Text,, Enter some Text and press Submit:
pt_br: Gui, Add, Text,, Insira algum texto e pressione Enviar:

source: Hand-held Remote Controls
pt_br: Controles Remotos de Mão

source: Help - Open the AutoHotkey offline help file.
pt_br: Help - Abre o arquivo de ajuda offline do AutoHotkey.

source: Help Settings
pt_br: Configurações da Ajuda

source: Help us help you.
pt_br: Ajude-nos a lhe ajudar.

source: Here are a few more samples:
pt_br: Eis mais algumas amostras:

source: Here are some examples.
pt_br: Aqui estão alguns exemplos.

source: Here are the four most common symbols:
pt_br: Eis os quatro símbolos mais comuns:

source: Here is a simple example on how to ask the user a couple of questions and doing some stuff with what was entered:
pt_br: Aqui está um exemplo simples de como fazer um par de perguntas ao usuário e, em seguida, fazer algo com o dado inserido:

source: Here is a very basic script containing a hotkey which types text using the Send command when the hotkey is pressed:
pt_br: Eis um script bem básico contendo uma tecla de atalho que faz o programa digitar texto usando o comando Send quando a tecla de atalho é pressionada: (NdT: daqui em diante, a expressão “tecla de atalho” será substituída por “hotkey”, para melhor combinar com a identidade do programa.)

source: Here is an example.
pt_br: Aqui está um exemplo.

source: Hexadecimal integers, such as 0x7B, 0x007B or -0x1.
pt_br: Inteiros hexadecimais, como 0x78, 0x007B ou -0x1.

source: Hexadecimal numbers must use the 0x or 0X prefix, except where noted in the documentation.
pt_br: Números hexadecimais devem usar o prefixo 0x ou 0X, exceto onde estiver especificado na documentação.

source: Hidden
pt_br: Oculta

source: Hip Hip Hooray!
pt_br: Woohoo!

source: Hold Ctrl or Shift when the installer starts.
pt_br: Segure Ctrl ou Shift quando o instalador iniciar.

source: Holds Alt down until {Alt up} is sent.
pt_br: Segura Alt até que {Alt up} seja enviada.

source: Holds Ctrl down until {Ctrl up} is sent.
pt_br: Segura Ctrl até que {Ctrl up} seja enviada.
